---
kind: method
id: M:Autodesk.Revit.DB.Electrical.PanelScheduleData.RemoveLoadClassification(System.Int32)
source: html/4cae60f4-6694-24db-0c46-b6d6fbdaae75.htm
---
# Autodesk.Revit.DB.Electrical.PanelScheduleData.RemoveLoadClassification Method

Remove a Load Classification Id from the array of Load Classifications

## Syntax (C#)
```csharp
public void RemoveLoadClassification(
	int nIndex
)
```

## Parameters
- **nIndex** (`System.Int32`) - The index at which to remove the load classification